#1.MRTG
mrtg（Multi Router Traffic Grapher）是一套用来绘出网络流量图的软件（通过snmp获取数据，通过web展示数据）；
##优点：
-简单易上手，安装完改下配置文件即可使用；
##缺点：
-使用文本式数据库；
-查看数据方式不够丰富；
-只能存储两个DS（Data Source）（流量输入和输出）；
-取一次数据需绘图一次，浪费系统资源；
-图像较模糊；
-无用户、图像管理功能；
-没有详细日志系统；
-无法详细了解各流量的构成；
-只能用于TCP/IP网络，对于SAN网络流量无能为力；
-不能在命令行下工作。
#2.RRDTOOL
rrdtool是一个非常棒的画图工具(作者就是MRTG的作者)
##优点：
-使用RRD（Round Robin Database）存储格式，数据等于放在数据库中，可方便调用。如将一个RRD文件中的数据与另一个RRD文件中的数据相加。
-可定义任意时间段画图，可以用半年数据画一张图，也可以用半小时内的数据画一张图。
-能画任意个DS，多种图形显示方式。
-数据存储与绘图分开，减轻系统负载。
-能任意处理RRD文件中的数据，如，在浏览监测中我们需要将数据由Bytes转化为bits，可以将原始数据乘8。
##缺点：
-RRDTool的作用只是存储数据和画图，它没有MRTG中集成的数据采集功能。
-在命令行下的使用非常复杂，参数极多。
-无用户、图像管理功能。
#3.Cacti
Cacti是一个用rrdtool画图的网络监控系统，集成了各种数据收集功能，在用rrdtool画出监控图像，界面很漂亮。
